Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
extern volatile __OFF155bits_t OFF155bits __asm__ ("OFF155") __attribute__((section("sfrs"), address(0xBF8107AC)));
#define OFF156 OFF156
extern volatile uint32_t   OFF156 __attribute__((section("sfrs"), address(0xBF8107B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF156bits_t;
extern volatile __OFF156bits_t OFF156bits __asm__ ("OFF156") __attribute__((section("sfrs"), address(0xBF8107B0)));
#define OFF157 OFF157
extern volatile uint32_t   OFF157 __attribute__((section("sfrs"), address(0xBF8107B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF157bits_t;
extern volatile __OFF157bits_t OFF157bits __asm__ ("OFF157") __attribute__((section("sfrs"), address(0xBF8107B4)));
#define OFF158 OFF158
extern volatile uint32_t   OFF158 __attribute__((section("sfrs"), address(0xBF8107B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF158bits_t;
extern volatile __OFF158bits_t OFF158bits __asm__ ("OFF158") __attribute__((section("sfrs"), address(0xBF8107B8)));
#define OFF159 OFF159
extern volatile uint32_t   OFF159 __attribute__((section("sfrs"), address(0xBF8107BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF159bits_t;
extern volatile __OFF159bits_t OFF159bits __asm__ ("OFF159") __attribute__((section("sfrs"), address(0xBF8107BC)));
#define OFF160 OFF160
extern volatile uint32_t   OFF160 __attribute__((section("sfrs"), address(0xBF8107C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF160bits_t;
extern volatile __OFF160bits_t OFF160bits __asm__ ("OFF160") __attribute__((section("sfrs"), address(0xBF8107C0)));
#define OFF161 OFF161
extern volatile uint32_t   OFF161 __attribute__((section("sfrs"), address(0xBF8107C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF161bits_t;
extern volatile __OFF161bits_t OFF161bits __asm__ ("OFF161") __attribute__((section("sfrs"), address(0xBF8107C4)));
#define OFF162 OFF162
extern volatile uint32_t   OFF162 __attribute__((section("sfrs"), address(0xBF8107C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF162bits_t;
extern volatile __OFF162bits_t OFF162bits __asm__ ("OFF162") __attribute__((section("sfrs"), address(0xBF8107C8)));
#define OFF167 OFF167
extern volatile uint32_t   OFF167 __attribute__((section("sfrs"), address(0xBF8107DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF167bits_t;
extern volatile __OFF167bits_t OFF167bits __asm__ ("OFF167") __attribute__((section("sfrs"), address(0xBF8107DC)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF230 OFF230
extern volatile uint32_t   OFF230 __attribute__((section("sfrs"), address(0xBF8108D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF230bits_t;
extern volatile __OFF230bits_t OFF230bits __asm__ ("OFF230") __attribute__((section("sfrs"), address(0xBF8108D8)));
#define OFF245 OFF245
extern volatile uint32_t   OFF245 __attribute__((section("sfrs"), address(0xBF810914)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF245bits_t;
extern volatile __OFF245bits_t OFF245bits __asm__ ("OFF245") __attribute__((section("sfrs"), address(0xBF810914)));
#define OFF246 OFF246
extern volatile uint32_t   OFF246 __attribute__((section("sfrs"), address(0xBF810918)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF246bits_t;
extern volatile __OFF246bits_t OFF246bits __asm__ ("OFF246") __attribute__((section("sfrs"), address(0xBF810918)));
#define OFF247 OFF247
extern volatile uint32_t   OFF247 __attribute__((section("sfrs"), address(0xBF81091C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF247bits_t;
extern volatile __OFF247bits_t OFF247bits __asm__ ("OFF247") __attribute__((section("sfrs"), address(0xBF81091C)));
#define OFF249 OFF249
extern volatile uint32_t   OFF249 __attribute__((section("sfrs"), address(0xBF810924)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF249bits_t;
extern volatile __OFF249bits_t OFF249bits __asm__ ("OFF249") __attribute__((section("sfrs"), address(0xBF810924)));
#define OFF250 OFF250
extern volatile uint32_t   OFF250 __attribute__((section("sfrs"), address(0xBF810928)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF250bits_t;
extern volatile __OFF250bits_t OFF250bits __asm__ ("OFF250") __attribute__((section("sfrs"), address(0xBF810928)));
#define OFF251 OFF251
extern volatile uint32_t   OFF251 __attribute__((section("sfrs"), address(0xBF81092C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF251bits_t;
extern volatile __OFF251bits_t OFF251bits __asm__ ("OFF251") __attribute__((section("sfrs"), address(0xBF81092C)));
#define OFF252 OFF252
extern volatile uint32_t   OFF252 __attribute__((section("sfrs"), address(0xBF810930)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF252bits_t;
extern volatile __OFF252bits_t OFF252bits __asm__ ("OFF252") __attribute__((section("sfrs"), address(0xBF810930)));
#define OFF254 OFF254
extern volatile uint32_t   OFF254 __attribute__((section("sfrs"), address(0xBF810938)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF254bits_t;
extern volatile __OFF254bits_t OFF254bits __asm__ ("OFF254") __attribute__((section("sfrs"), address(0xBF810938)));
#define OFF255 OFF255
extern volatile uint32_t   OFF255 __attribute__((section("sfrs"), address(0xBF81093C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF255bits_t;
