Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
extern volatile __CFD1FLTCON7bits_t CFD1FLTCON7bits __asm__ ("CFD1FLTCON7") __attribute__((section("sfrs"), address(0xBF8807B0)));
extern volatile uint32_t        CFD1FLTCON7CLR __attribute__((section("sfrs"),address(0xBF8807B4)));
extern volatile uint32_t        CFD1FLTCON7SET __attribute__((section("sfrs"),address(0xBF8807B8)));
extern volatile uint32_t        CFD1FLTCON7INV __attribute__((section("sfrs"),address(0xBF8807BC)));
#define CFD1FLTOBJ0 CFD1FLTOBJ0
extern volatile uint32_t   CFD1FLTOBJ0 __attribute__((section("sfrs"), address(0xBF8807C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ0bits_t;
extern volatile __CFD1FLTOBJ0bits_t CFD1FLTOBJ0bits __asm__ ("CFD1FLTOBJ0") __attribute__((section("sfrs"), address(0xBF8807C0)));
extern volatile uint32_t        CFD1FLTOBJ0CLR __attribute__((section("sfrs"),address(0xBF8807C4)));
extern volatile uint32_t        CFD1FLTOBJ0SET __attribute__((section("sfrs"),address(0xBF8807C8)));
extern volatile uint32_t        CFD1FLTOBJ0INV __attribute__((section("sfrs"),address(0xBF8807CC)));
#define CFD1MASK0 CFD1MASK0
extern volatile uint32_t   CFD1MASK0 __attribute__((section("sfrs"), address(0xBF8807D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK0bits_t;
extern volatile __CFD1MASK0bits_t CFD1MASK0bits __asm__ ("CFD1MASK0") __attribute__((section("sfrs"), address(0xBF8807D0)));
extern volatile uint32_t        CFD1MASK0CLR __attribute__((section("sfrs"),address(0xBF8807D4)));
extern volatile uint32_t        CFD1MASK0SET __attribute__((section("sfrs"),address(0xBF8807D8)));
extern volatile uint32_t        CFD1MASK0INV __attribute__((section("sfrs"),address(0xBF8807DC)));
#define CFD1FLTOBJ1 CFD1FLTOBJ1
extern volatile uint32_t   CFD1FLTOBJ1 __attribute__((section("sfrs"), address(0xBF8807E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ1bits_t;
extern volatile __CFD1FLTOBJ1bits_t CFD1FLTOBJ1bits __asm__ ("CFD1FLTOBJ1") __attribute__((section("sfrs"), address(0xBF8807E0)));
extern volatile uint32_t        CFD1FLTOBJ1CLR __attribute__((section("sfrs"),address(0xBF8807E4)));
extern volatile uint32_t        CFD1FLTOBJ1SET __attribute__((section("sfrs"),address(0xBF8807E8)));
extern volatile uint32_t        CFD1FLTOBJ1INV __attribute__((section("sfrs"),address(0xBF8807EC)));
#define CFD1MASK1 CFD1MASK1
extern volatile uint32_t   CFD1MASK1 __attribute__((section("sfrs"), address(0xBF8807F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK1bits_t;
extern volatile __CFD1MASK1bits_t CFD1MASK1bits __asm__ ("CFD1MASK1") __attribute__((section("sfrs"), address(0xBF8807F0)));
extern volatile uint32_t        CFD1MASK1CLR __attribute__((section("sfrs"),address(0xBF8807F4)));
extern volatile uint32_t        CFD1MASK1SET __attribute__((section("sfrs"),address(0xBF8807F8)));
extern volatile uint32_t        CFD1MASK1INV __attribute__((section("sfrs"),address(0xBF8807FC)));
#define CFD1FLTOBJ2 CFD1FLTOBJ2
extern volatile uint32_t   CFD1FLTOBJ2 __attribute__((section("sfrs"), address(0xBF880800)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ2bits_t;
extern volatile __CFD1FLTOBJ2bits_t CFD1FLTOBJ2bits __asm__ ("CFD1FLTOBJ2") __attribute__((section("sfrs"), address(0xBF880800)));
extern volatile uint32_t        CFD1FLTOBJ2CLR __attribute__((section("sfrs"),address(0xBF880804)));
extern volatile uint32_t        CFD1FLTOBJ2SET __attribute__((section("sfrs"),address(0xBF880808)));
extern volatile uint32_t        CFD1FLTOBJ2INV __attribute__((section("sfrs"),address(0xBF88080C)));
#define CFD1MASK2 CFD1MASK2
extern volatile uint32_t   CFD1MASK2 __attribute__((section("sfrs"), address(0xBF880810)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK2bits_t;
extern volatile __CFD1MASK2bits_t CFD1MASK2bits __asm__ ("CFD1MASK2") __attribute__((section("sfrs"), address(0xBF880810)));
extern volatile uint32_t        CFD1MASK2CLR __attribute__((section("sfrs"),address(0xBF880814)));
extern volatile uint32_t        CFD1MASK2SET __attribute__((section("sfrs"),address(0xBF880818)));
extern volatile uint32_t        CFD1MASK2INV __attribute__((section("sfrs"),address(0xBF88081C)));
#define CFD1FLTOBJ3 CFD1FLTOBJ3
extern volatile uint32_t   CFD1FLTOBJ3 __attribute__((section("sfrs"), address(0xBF880820)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ3bits_t;
extern volatile __CFD1FLTOBJ3bits_t CFD1FLTOBJ3bits __asm__ ("CFD1FLTOBJ3") __attribute__((section("sfrs"), address(0xBF880820)));
extern volatile uint32_t        CFD1FLTOBJ3CLR __attribute__((section("sfrs"),address(0xBF880824)));
extern volatile uint32_t        CFD1FLTOBJ3SET __attribute__((section("sfrs"),address(0xBF880828)));
extern volatile uint32_t        CFD1FLTOBJ3INV __attribute__((section("sfrs"),address(0xBF88082C)));
#define CFD1MASK3 CFD1MASK3
extern volatile uint32_t   CFD1MASK3 __attribute__((section("sfrs"), address(0xBF880830)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK3bits_t;
extern volatile __CFD1MASK3bits_t CFD1MASK3bits __asm__ ("CFD1MASK3") __attribute__((section("sfrs"), address(0xBF880830)));
extern volatile uint32_t        CFD1MASK3CLR __attribute__((section("sfrs"),address(0xBF880834)));
extern volatile uint32_t        CFD1MASK3SET __attribute__((section("sfrs"),address(0xBF880838)));
extern volatile uint32_t        CFD1MASK3INV __attribute__((section("sfrs"),address(0xBF88083C)));
#define CFD1FLTOBJ4 CFD1FLTOBJ4
extern volatile uint32_t   CFD1FLTOBJ4 __attribute__((section("sfrs"), address(0xBF880840)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ4bits_t;
