Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
extern volatile __CFD1FLTOBJ14bits_t CFD1FLTOBJ14bits __asm__ ("CFD1FLTOBJ14") __attribute__((section("sfrs"), address(0xBF880980)));
extern volatile uint32_t        CFD1FLTOBJ14CLR __attribute__((section("sfrs"),address(0xBF880984)));
extern volatile uint32_t        CFD1FLTOBJ14SET __attribute__((section("sfrs"),address(0xBF880988)));
extern volatile uint32_t        CFD1FLTOBJ14INV __attribute__((section("sfrs"),address(0xBF88098C)));
#define CFD1MASK14 CFD1MASK14
extern volatile uint32_t   CFD1MASK14 __attribute__((section("sfrs"), address(0xBF880990)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK14bits_t;
extern volatile __CFD1MASK14bits_t CFD1MASK14bits __asm__ ("CFD1MASK14") __attribute__((section("sfrs"), address(0xBF880990)));
extern volatile uint32_t        CFD1MASK14CLR __attribute__((section("sfrs"),address(0xBF880994)));
extern volatile uint32_t        CFD1MASK14SET __attribute__((section("sfrs"),address(0xBF880998)));
extern volatile uint32_t        CFD1MASK14INV __attribute__((section("sfrs"),address(0xBF88099C)));
#define CFD1FLTOBJ15 CFD1FLTOBJ15
extern volatile uint32_t   CFD1FLTOBJ15 __attribute__((section("sfrs"), address(0xBF8809A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ15bits_t;
extern volatile __CFD1FLTOBJ15bits_t CFD1FLTOBJ15bits __asm__ ("CFD1FLTOBJ15") __attribute__((section("sfrs"), address(0xBF8809A0)));
extern volatile uint32_t        CFD1FLTOBJ15CLR __attribute__((section("sfrs"),address(0xBF8809A4)));
extern volatile uint32_t        CFD1FLTOBJ15SET __attribute__((section("sfrs"),address(0xBF8809A8)));
extern volatile uint32_t        CFD1FLTOBJ15INV __attribute__((section("sfrs"),address(0xBF8809AC)));
#define CFD1MASK15 CFD1MASK15
extern volatile uint32_t   CFD1MASK15 __attribute__((section("sfrs"), address(0xBF8809B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK15bits_t;
extern volatile __CFD1MASK15bits_t CFD1MASK15bits __asm__ ("CFD1MASK15") __attribute__((section("sfrs"), address(0xBF8809B0)));
extern volatile uint32_t        CFD1MASK15CLR __attribute__((section("sfrs"),address(0xBF8809B4)));
extern volatile uint32_t        CFD1MASK15SET __attribute__((section("sfrs"),address(0xBF8809B8)));
extern volatile uint32_t        CFD1MASK15INV __attribute__((section("sfrs"),address(0xBF8809BC)));
#define CFD1FLTOBJ16 CFD1FLTOBJ16
extern volatile uint32_t   CFD1FLTOBJ16 __attribute__((section("sfrs"), address(0xBF8809C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ16bits_t;
extern volatile __CFD1FLTOBJ16bits_t CFD1FLTOBJ16bits __asm__ ("CFD1FLTOBJ16") __attribute__((section("sfrs"), address(0xBF8809C0)));
extern volatile uint32_t        CFD1FLTOBJ16CLR __attribute__((section("sfrs"),address(0xBF8809C4)));
extern volatile uint32_t        CFD1FLTOBJ16SET __attribute__((section("sfrs"),address(0xBF8809C8)));
extern volatile uint32_t        CFD1FLTOBJ16INV __attribute__((section("sfrs"),address(0xBF8809CC)));
#define CFD1MASK16 CFD1MASK16
extern volatile uint32_t   CFD1MASK16 __attribute__((section("sfrs"), address(0xBF8809D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK16bits_t;
extern volatile __CFD1MASK16bits_t CFD1MASK16bits __asm__ ("CFD1MASK16") __attribute__((section("sfrs"), address(0xBF8809D0)));
extern volatile uint32_t        CFD1MASK16CLR __attribute__((section("sfrs"),address(0xBF8809D4)));
extern volatile uint32_t        CFD1MASK16SET __attribute__((section("sfrs"),address(0xBF8809D8)));
extern volatile uint32_t        CFD1MASK16INV __attribute__((section("sfrs"),address(0xBF8809DC)));
#define CFD1FLTOBJ17 CFD1FLTOBJ17
extern volatile uint32_t   CFD1FLTOBJ17 __attribute__((section("sfrs"), address(0xBF8809E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ17bits_t;
extern volatile __CFD1FLTOBJ17bits_t CFD1FLTOBJ17bits __asm__ ("CFD1FLTOBJ17") __attribute__((section("sfrs"), address(0xBF8809E0)));
extern volatile uint32_t        CFD1FLTOBJ17CLR __attribute__((section("sfrs"),address(0xBF8809E4)));
extern volatile uint32_t        CFD1FLTOBJ17SET __attribute__((section("sfrs"),address(0xBF8809E8)));
extern volatile uint32_t        CFD1FLTOBJ17INV __attribute__((section("sfrs"),address(0xBF8809EC)));
#define CFD1MASK17 CFD1MASK17
extern volatile uint32_t   CFD1MASK17 __attribute__((section("sfrs"), address(0xBF8809F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK17bits_t;
extern volatile __CFD1MASK17bits_t CFD1MASK17bits __asm__ ("CFD1MASK17") __attribute__((section("sfrs"), address(0xBF8809F0)));
extern volatile uint32_t        CFD1MASK17CLR __attribute__((section("sfrs"),address(0xBF8809F4)));
extern volatile uint32_t        CFD1MASK17SET __attribute__((section("sfrs"),address(0xBF8809F8)));
extern volatile uint32_t        CFD1MASK17INV __attribute__((section("sfrs"),address(0xBF8809FC)));
#define CFD1FLTOBJ18 CFD1FLTOBJ18
extern volatile uint32_t   CFD1FLTOBJ18 __attribute__((section("sfrs"), address(0xBF880A00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ18bits_t;
extern volatile __CFD1FLTOBJ18bits_t CFD1FLTOBJ18bits __asm__ ("CFD1FLTOBJ18") __attribute__((section("sfrs"), address(0xBF880A00)));
extern volatile uint32_t        CFD1FLTOBJ18CLR __attribute__((section("sfrs"),address(0xBF880A04)));
extern volatile uint32_t        CFD1FLTOBJ18SET __attribute__((section("sfrs"),address(0xBF880A08)));
extern volatile uint32_t        CFD1FLTOBJ18INV __attribute__((section("sfrs"),address(0xBF880A0C)));
#define CFD1MASK18 CFD1MASK18
extern volatile uint32_t   CFD1MASK18 __attribute__((section("sfrs"), address(0xBF880A10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK18bits_t;
extern volatile __CFD1MASK18bits_t CFD1MASK18bits __asm__ ("CFD1MASK18") __attribute__((section("sfrs"), address(0xBF880A10)));
extern volatile uint32_t        CFD1MASK18CLR __attribute__((section("sfrs"),address(0xBF880A14)));
extern volatile uint32_t        CFD1MASK18SET __attribute__((section("sfrs"),address(0xBF880A18)));
extern volatile uint32_t        CFD1MASK18INV __attribute__((section("sfrs"),address(0xBF880A1C)));
#define CFD1FLTOBJ19 CFD1FLTOBJ19
extern volatile uint32_t   CFD1FLTOBJ19 __attribute__((section("sfrs"), address(0xBF880A20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ19bits_t;
extern volatile __CFD1FLTOBJ19bits_t CFD1FLTOBJ19bits __asm__ ("CFD1FLTOBJ19") __attribute__((section("sfrs"), address(0xBF880A20)));
extern volatile uint32_t        CFD1FLTOBJ19CLR __attribute__((section("sfrs"),address(0xBF880A24)));
extern volatile uint32_t        CFD1FLTOBJ19SET __attribute__((section("sfrs"),address(0xBF880A28)));
extern volatile uint32_t        CFD1FLTOBJ19INV __attribute__((section("sfrs"),address(0xBF880A2C)));
#define CFD1MASK19 CFD1MASK19
extern volatile uint32_t   CFD1MASK19 __attribute__((section("sfrs"), address(0xBF880A30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK19bits_t;
extern volatile __CFD1MASK19bits_t CFD1MASK19bits __asm__ ("CFD1MASK19") __attribute__((section("sfrs"), address(0xBF880A30)));
extern volatile uint32_t        CFD1MASK19CLR __attribute__((section("sfrs"),address(0xBF880A34)));
extern volatile uint32_t        CFD1MASK19SET __attribute__((section("sfrs"),address(0xBF880A38)));
extern volatile uint32_t        CFD1MASK19INV __attribute__((section("sfrs"),address(0xBF880A3C)));
#define CFD1FLTOBJ20 CFD1FLTOBJ20
extern volatile uint32_t   CFD1FLTOBJ20 __attribute__((section("sfrs"), address(0xBF880A40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ20bits_t;
