Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
extern volatile __ADCANCONbits_t ADCANCONbits __asm__ ("ADCANCON") __attribute__((section("sfrs"), address(0xBF887400)));
extern volatile uint32_t        ADCANCONCLR __attribute__((section("sfrs"),address(0xBF887404)));
extern volatile uint32_t        ADCANCONSET __attribute__((section("sfrs"),address(0xBF887408)));
extern volatile uint32_t        ADCANCONINV __attribute__((section("sfrs"),address(0xBF88740C)));
#define ADCDATA0 ADCDATA0
extern volatile uint32_t   ADCDATA0 __attribute__((section("sfrs"), address(0xBF887600)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA0bits_t;
extern volatile __ADCDATA0bits_t ADCDATA0bits __asm__ ("ADCDATA0") __attribute__((section("sfrs"), address(0xBF887600)));
extern volatile uint32_t        ADCDATA0CLR __attribute__((section("sfrs"),address(0xBF887604)));
extern volatile uint32_t        ADCDATA0SET __attribute__((section("sfrs"),address(0xBF887608)));
extern volatile uint32_t        ADCDATA0INV __attribute__((section("sfrs"),address(0xBF88760C)));
#define ADCDATA1 ADCDATA1
extern volatile uint32_t   ADCDATA1 __attribute__((section("sfrs"), address(0xBF887610)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA1bits_t;
extern volatile __ADCDATA1bits_t ADCDATA1bits __asm__ ("ADCDATA1") __attribute__((section("sfrs"), address(0xBF887610)));
extern volatile uint32_t        ADCDATA1CLR __attribute__((section("sfrs"),address(0xBF887614)));
extern volatile uint32_t        ADCDATA1SET __attribute__((section("sfrs"),address(0xBF887618)));
extern volatile uint32_t        ADCDATA1INV __attribute__((section("sfrs"),address(0xBF88761C)));
#define ADCDATA2 ADCDATA2
extern volatile uint32_t   ADCDATA2 __attribute__((section("sfrs"), address(0xBF887620)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA2bits_t;
extern volatile __ADCDATA2bits_t ADCDATA2bits __asm__ ("ADCDATA2") __attribute__((section("sfrs"), address(0xBF887620)));
extern volatile uint32_t        ADCDATA2CLR __attribute__((section("sfrs"),address(0xBF887624)));
extern volatile uint32_t        ADCDATA2SET __attribute__((section("sfrs"),address(0xBF887628)));
extern volatile uint32_t        ADCDATA2INV __attribute__((section("sfrs"),address(0xBF88762C)));
#define ADCDATA3 ADCDATA3
extern volatile uint32_t   ADCDATA3 __attribute__((section("sfrs"), address(0xBF887630)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA3bits_t;
extern volatile __ADCDATA3bits_t ADCDATA3bits __asm__ ("ADCDATA3") __attribute__((section("sfrs"), address(0xBF887630)));
extern volatile uint32_t        ADCDATA3CLR __attribute__((section("sfrs"),address(0xBF887634)));
extern volatile uint32_t        ADCDATA3SET __attribute__((section("sfrs"),address(0xBF887638)));
extern volatile uint32_t        ADCDATA3INV __attribute__((section("sfrs"),address(0xBF88763C)));
#define ADCDATA4 ADCDATA4
extern volatile uint32_t   ADCDATA4 __attribute__((section("sfrs"), address(0xBF887640)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA4bits_t;
extern volatile __ADCDATA4bits_t ADCDATA4bits __asm__ ("ADCDATA4") __attribute__((section("sfrs"), address(0xBF887640)));
extern volatile uint32_t        ADCDATA4CLR __attribute__((section("sfrs"),address(0xBF887644)));
extern volatile uint32_t        ADCDATA4SET __attribute__((section("sfrs"),address(0xBF887648)));
extern volatile uint32_t        ADCDATA4INV __attribute__((section("sfrs"),address(0xBF88764C)));
#define ADCDATA5 ADCDATA5
extern volatile uint32_t   ADCDATA5 __attribute__((section("sfrs"), address(0xBF887650)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA5bits_t;
extern volatile __ADCDATA5bits_t ADCDATA5bits __asm__ ("ADCDATA5") __attribute__((section("sfrs"), address(0xBF887650)));
extern volatile uint32_t        ADCDATA5CLR __attribute__((section("sfrs"),address(0xBF887654)));
extern volatile uint32_t        ADCDATA5SET __attribute__((section("sfrs"),address(0xBF887658)));
extern volatile uint32_t        ADCDATA5INV __attribute__((section("sfrs"),address(0xBF88765C)));
#define ADCDATA6 ADCDATA6
extern volatile uint32_t   ADCDATA6 __attribute__((section("sfrs"), address(0xBF887660)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA6bits_t;
extern volatile __ADCDATA6bits_t ADCDATA6bits __asm__ ("ADCDATA6") __attribute__((section("sfrs"), address(0xBF887660)));
extern volatile uint32_t        ADCDATA6CLR __attribute__((section("sfrs"),address(0xBF887664)));
extern volatile uint32_t        ADCDATA6SET __attribute__((section("sfrs"),address(0xBF887668)));
extern volatile uint32_t        ADCDATA6INV __attribute__((section("sfrs"),address(0xBF88766C)));
#define ADCDATA7 ADCDATA7
extern volatile uint32_t   ADCDATA7 __attribute__((section("sfrs"), address(0xBF887670)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA7bits_t;
extern volatile __ADCDATA7bits_t ADCDATA7bits __asm__ ("ADCDATA7") __attribute__((section("sfrs"), address(0xBF887670)));
extern volatile uint32_t        ADCDATA7CLR __attribute__((section("sfrs"),address(0xBF887674)));
extern volatile uint32_t        ADCDATA7SET __attribute__((section("sfrs"),address(0xBF887678)));
extern volatile uint32_t        ADCDATA7INV __attribute__((section("sfrs"),address(0xBF88767C)));
#define ADCDATA8 ADCDATA8
extern volatile uint32_t   ADCDATA8 __attribute__((section("sfrs"), address(0xBF887680)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA8bits_t;
extern volatile __ADCDATA8bits_t ADCDATA8bits __asm__ ("ADCDATA8") __attribute__((section("sfrs"), address(0xBF887680)));
extern volatile uint32_t        ADCDATA8CLR __attribute__((section("sfrs"),address(0xBF887684)));
extern volatile uint32_t        ADCDATA8SET __attribute__((section("sfrs"),address(0xBF887688)));
extern volatile uint32_t        ADCDATA8INV __attribute__((section("sfrs"),address(0xBF88768C)));
#define ADCDATA9 ADCDATA9
extern volatile uint32_t   ADCDATA9 __attribute__((section("sfrs"), address(0xBF887690)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA9bits_t;
extern volatile __ADCDATA9bits_t ADCDATA9bits __asm__ ("ADCDATA9") __attribute__((section("sfrs"), address(0xBF887690)));
extern volatile uint32_t        ADCDATA9CLR __attribute__((section("sfrs"),address(0xBF887694)));
extern volatile uint32_t        ADCDATA9SET __attribute__((section("sfrs"),address(0xBF887698)));
extern volatile uint32_t        ADCDATA9INV __attribute__((section("sfrs"),address(0xBF88769C)));
#define ADCDATA10 ADCDATA10
extern volatile uint32_t   ADCDATA10 __attribute__((section("sfrs"), address(0xBF8876A0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA10bits_t;
extern volatile __ADCDATA10bits_t ADCDATA10bits __asm__ ("ADCDATA10") __attribute__((section("sfrs"), address(0xBF8876A0)));
extern volatile uint32_t        ADCDATA10CLR __attribute__((section("sfrs"),address(0xBF8876A4)));
extern volatile uint32_t        ADCDATA10SET __attribute__((section("sfrs"),address(0xBF8876A8)));
extern volatile uint32_t        ADCDATA10INV __attribute__((section("sfrs"),address(0xBF8876AC)));
#define ADCDATA11 ADCDATA11
extern volatile uint32_t   ADCDATA11 __attribute__((section("sfrs"), address(0xBF8876B0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA11bits_t;
extern volatile __ADCDATA11bits_t ADCDATA11bits __asm__ ("ADCDATA11") __attribute__((section("sfrs"), address(0xBF8876B0)));
extern volatile uint32_t        ADCDATA11CLR __attribute__((section("sfrs"),address(0xBF8876B4)));
extern volatile uint32_t        ADCDATA11SET __attribute__((section("sfrs"),address(0xBF8876B8)));
extern volatile uint32_t        ADCDATA11INV __attribute__((section("sfrs"),address(0xBF8876BC)));
#define ADCDATA12 ADCDATA12
extern volatile uint32_t   ADCDATA12 __attribute__((section("sfrs"), address(0xBF8876C0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA12bits_t;
extern volatile __ADCDATA12bits_t ADCDATA12bits __asm__ ("ADCDATA12") __attribute__((section("sfrs"), address(0xBF8876C0)));
extern volatile uint32_t        ADCDATA12CLR __attribute__((section("sfrs"),address(0xBF8876C4)));
extern volatile uint32_t        ADCDATA12SET __attribute__((section("sfrs"),address(0xBF8876C8)));
extern volatile uint32_t        ADCDATA12INV __attribute__((section("sfrs"),address(0xBF8876CC)));
#define ADCDATA13 ADCDATA13
extern volatile uint32_t   ADCDATA13 __attribute__((section("sfrs"), address(0xBF8876D0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA13bits_t;
extern volatile __ADCDATA13bits_t ADCDATA13bits __asm__ ("ADCDATA13") __attribute__((section("sfrs"), address(0xBF8876D0)));
extern volatile uint32_t        ADCDATA13CLR __attribute__((section("sfrs"),address(0xBF8876D4)));
extern volatile uint32_t        ADCDATA13SET __attribute__((section("sfrs"),address(0xBF8876D8)));
extern volatile uint32_t        ADCDATA13INV __attribute__((section("sfrs"),address(0xBF8876DC)));
#define ADCDATA14 ADCDATA14
extern volatile uint32_t   ADCDATA14 __attribute__((section("sfrs"), address(0xBF8876E0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA14bits_t;
extern volatile __ADCDATA14bits_t ADCDATA14bits __asm__ ("ADCDATA14") __attribute__((section("sfrs"), address(0xBF8876E0)));
extern volatile uint32_t        ADCDATA14CLR __attribute__((section("sfrs"),address(0xBF8876E4)));
extern volatile uint32_t        ADCDATA14SET __attribute__((section("sfrs"),address(0xBF8876E8)));
extern volatile uint32_t        ADCDATA14INV __attribute__((section("sfrs"),address(0xBF8876EC)));
#define ADCDATA15 ADCDATA15
extern volatile uint32_t   ADCDATA15 __attribute__((section("sfrs"), address(0xBF8876F0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA15bits_t;
extern volatile __ADCDATA15bits_t ADCDATA15bits __asm__ ("ADCDATA15") __attribute__((section("sfrs"), address(0xBF8876F0)));
extern volatile uint32_t        ADCDATA15CLR __attribute__((section("sfrs"),address(0xBF8876F4)));
extern volatile uint32_t        ADCDATA15SET __attribute__((section("sfrs"),address(0xBF8876F8)));
extern volatile uint32_t        ADCDATA15INV __attribute__((section("sfrs"),address(0xBF8876FC)));
#define ADCDATA16 ADCDATA16
extern volatile uint32_t   ADCDATA16 __attribute__((section("sfrs"), address(0xBF887700)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA16bits_t;
extern volatile __ADCDATA16bits_t ADCDATA16bits __asm__ ("ADCDATA16") __attribute__((section("sfrs"), address(0xBF887700)));
extern volatile uint32_t        ADCDATA16CLR __attribute__((section("sfrs"),address(0xBF887704)));
extern volatile uint32_t        ADCDATA16SET __attribute__((section("sfrs"),address(0xBF887708)));
extern volatile uint32_t        ADCDATA16INV __attribute__((section("sfrs"),address(0xBF88770C)));
#define ADCDATA17 ADCDATA17
extern volatile uint32_t   ADCDATA17 __attribute__((section("sfrs"), address(0xBF887710)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits __asm__ ("ADCDATA17") __attribute__((section("sfrs"), address(0xBF887710)));
extern volatile uint32_t        ADCDATA17CLR __attribute__((section("sfrs"),address(0xBF887714)));
extern volatile uint32_t        ADCDATA17SET __attribute__((section("sfrs"),address(0xBF887718)));
extern volatile uint32_t        ADCDATA17INV __attribute__((section("sfrs"),address(0xBF88771C)));
#define ADCDATA18 ADCDATA18
extern volatile uint32_t   ADCDATA18 __attribute__((section("sfrs"), address(0xBF887720)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits __asm__ ("ADCDATA18") __attribute__((section("sfrs"), address(0xBF887720)));
extern volatile uint32_t        ADCDATA18CLR __attribute__((section("sfrs"),address(0xBF887724)));
extern volatile uint32_t        ADCDATA18SET __attribute__((section("sfrs"),address(0xBF887728)));
extern volatile uint32_t        ADCDATA18INV __attribute__((section("sfrs"),address(0xBF88772C)));
#define ADCDATA19 ADCDATA19
extern volatile uint32_t   ADCDATA19 __attribute__((section("sfrs"), address(0xBF887730)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA19bits_t;
extern volatile __ADCDATA19bits_t ADCDATA19bits __asm__ ("ADCDATA19") __attribute__((section("sfrs"), address(0xBF887730)));
extern volatile uint32_t        ADCDATA19CLR __attribute__((section("sfrs"),address(0xBF887734)));
extern volatile uint32_t        ADCDATA19SET __attribute__((section("sfrs"),address(0xBF887738)));
extern volatile uint32_t        ADCDATA19INV __attribute__((section("sfrs"),address(0xBF88773C)));
#define ADCDATA20 ADCDATA20
extern volatile uint32_t   ADCDATA20 __attribute__((section("sfrs"), address(0xBF887740)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA20bits_t;
extern volatile __ADCDATA20bits_t ADCDATA20bits __asm__ ("ADCDATA20") __attribute__((section("sfrs"), address(0xBF887740)));
extern volatile uint32_t        ADCDATA20CLR __attribute__((section("sfrs"),address(0xBF887744)));
extern volatile uint32_t        ADCDATA20SET __attribute__((section("sfrs"),address(0xBF887748)));
extern volatile uint32_t        ADCDATA20INV __attribute__((section("sfrs"),address(0xBF88774C)));
#define ADCDATA21 ADCDATA21
extern volatile uint32_t   ADCDATA21 __attribute__((section("sfrs"), address(0xBF887750)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA21bits_t;
extern volatile __ADCDATA21bits_t ADCDATA21bits __asm__ ("ADCDATA21") __attribute__((section("sfrs"), address(0xBF887750)));
extern volatile uint32_t        ADCDATA21CLR __attribute__((section("sfrs"),address(0xBF887754)));
extern volatile uint32_t        ADCDATA21SET __attribute__((section("sfrs"),address(0xBF887758)));
extern volatile uint32_t        ADCDATA21INV __attribute__((section("sfrs"),address(0xBF88775C)));
#define ADCDATA22 ADCDATA22
extern volatile uint32_t   ADCDATA22 __attribute__((section("sfrs"), address(0xBF887760)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA22bits_t;
extern volatile __ADCDATA22bits_t ADCDATA22bits __asm__ ("ADCDATA22") __attribute__((section("sfrs"), address(0xBF887760)));
extern volatile uint32_t        ADCDATA22CLR __attribute__((section("sfrs"),address(0xBF887764)));
extern volatile uint32_t        ADCDATA22SET __attribute__((section("sfrs"),address(0xBF887768)));
extern volatile uint32_t        ADCDATA22INV __attribute__((section("sfrs"),address(0xBF88776C)));
#define ADCDATA23 ADCDATA23
extern volatile uint32_t   ADCDATA23 __attribute__((section("sfrs"), address(0xBF887770)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA23bits_t;
extern volatile __ADCDATA23bits_t ADCDATA23bits __asm__ ("ADCDATA23") __attribute__((section("sfrs"), address(0xBF887770)));
extern volatile uint32_t        ADCDATA23CLR __attribute__((section("sfrs"),address(0xBF887774)));
extern volatile uint32_t        ADCDATA23SET __attribute__((section("sfrs"),address(0xBF887778)));
extern volatile uint32_t        ADCDATA23INV __attribute__((section("sfrs"),address(0xBF88777C)));
#define ADCDATA24 ADCDATA24
extern volatile uint32_t   ADCDATA24 __attribute__((section("sfrs"), address(0xBF887780)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA24bits_t;
extern volatile __ADCDATA24bits_t ADCDATA24bits __asm__ ("ADCDATA24") __attribute__((section("sfrs"), address(0xBF887780)));
extern volatile uint32_t        ADCDATA24CLR __attribute__((section("sfrs"),address(0xBF887784)));
extern volatile uint32_t        ADCDATA24SET __attribute__((section("sfrs"),address(0xBF887788)));
extern volatile uint32_t        ADCDATA24INV __attribute__((section("sfrs"),address(0xBF88778C)));
#define ADCDATA25 ADCDATA25
extern volatile uint32_t   ADCDATA25 __attribute__((section("sfrs"), address(0xBF887790)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA25bits_t;
extern volatile __ADCDATA25bits_t ADCDATA25bits __asm__ ("ADCDATA25") __attribute__((section("sfrs"), address(0xBF887790)));
extern volatile uint32_t        ADCDATA25CLR __attribute__((section("sfrs"),address(0xBF887794)));
extern volatile uint32_t        ADCDATA25SET __attribute__((section("sfrs"),address(0xBF887798)));
extern volatile uint32_t        ADCDATA25INV __attribute__((section("sfrs"),address(0xBF88779C)));
#define ADCDATA26 ADCDATA26
extern volatile uint32_t   ADCDATA26 __attribute__((section("sfrs"), address(0xBF8877A0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA26bits_t;
extern volatile __ADCDATA26bits_t ADCDATA26bits __asm__ ("ADCDATA26") __attribute__((section("sfrs"), address(0xBF8877A0)));
extern volatile uint32_t        ADCDATA26CLR __attribute__((section("sfrs"),address(0xBF8877A4)));
extern volatile uint32_t        ADCDATA26SET __attribute__((section("sfrs"),address(0xBF8877A8)));
extern volatile uint32_t        ADCDATA26INV __attribute__((section("sfrs"),address(0xBF8877AC)));
#define ADCDATA27 ADCDATA27
extern volatile uint32_t   ADCDATA27 __attribute__((section("sfrs"), address(0xBF8877B0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA27bits_t;
extern volatile __ADCDATA27bits_t ADCDATA27bits __asm__ ("ADCDATA27") __attribute__((section("sfrs"), address(0xBF8877B0)));
extern volatile uint32_t        ADCDATA27CLR __attribute__((section("sfrs"),address(0xBF8877B4)));
extern volatile uint32_t        ADCDATA27SET __attribute__((section("sfrs"),address(0xBF8877B8)));
extern volatile uint32_t        ADCDATA27INV __attribute__((section("sfrs"),address(0xBF8877BC)));
#define ADCDATA33 ADCDATA33
extern volatile uint32_t   ADCDATA33 __attribute__((section("sfrs"), address(0xBF887810)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA33bits_t;
extern volatile __ADCDATA33bits_t ADCDATA33bits __asm__ ("ADCDATA33") __attribute__((section("sfrs"), address(0xBF887810)));
extern volatile uint32_t        ADCDATA33CLR __attribute__((section("sfrs"),address(0xBF887814)));
extern volatile uint32_t        ADCDATA33SET __attribute__((section("sfrs"),address(0xBF887818)));
extern volatile uint32_t        ADCDATA33INV __attribute__((section("sfrs"),address(0xBF88781C)));
#define ADCDATA34 ADCDATA34
extern volatile uint32_t   ADCDATA34 __attribute__((section("sfrs"), address(0xBF887820)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA34bits_t;
extern volatile __ADCDATA34bits_t ADCDATA34bits __asm__ ("ADCDATA34") __attribute__((section("sfrs"), address(0xBF887820)));
extern volatile uint32_t        ADCDATA34CLR __attribute__((section("sfrs"),address(0xBF887824)));
extern volatile uint32_t        ADCDATA34SET __attribute__((section("sfrs"),address(0xBF887828)));
extern volatile uint32_t        ADCDATA34INV __attribute__((section("sfrs"),address(0xBF88782C)));
#define ADCDATA35 ADCDATA35
extern volatile uint32_t   ADCDATA35 __attribute__((section("sfrs"), address(0xBF887830)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA35bits_t;
extern volatile __ADCDATA35bits_t ADCDATA35bits __asm__ ("ADCDATA35") __attribute__((section("sfrs"), address(0xBF887830)));
extern volatile uint32_t        ADCDATA35CLR __attribute__((section("sfrs"),address(0xBF887834)));
extern volatile uint32_t        ADCDATA35SET __attribute__((section("sfrs"),address(0xBF887838)));
extern volatile uint32_t        ADCDATA35INV __attribute__((section("sfrs"),address(0xBF88783C)));
#define ADCDATA36 ADCDATA36
extern volatile uint32_t   ADCDATA36 __attribute__((section("sfrs"), address(0xBF887840)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA36bits_t;
extern volatile __ADCDATA36bits_t ADCDATA36bits __asm__ ("ADCDATA36") __attribute__((section("sfrs"), address(0xBF887840)));
extern volatile uint32_t        ADCDATA36CLR __attribute__((section("sfrs"),address(0xBF887844)));
extern volatile uint32_t        ADCDATA36SET __attribute__((section("sfrs"),address(0xBF887848)));
extern volatile uint32_t        ADCDATA36INV __attribute__((section("sfrs"),address(0xBF88784C)));
#define ADCDATA37 ADCDATA37
extern volatile uint32_t   ADCDATA37 __attribute__((section("sfrs"), address(0xBF887850)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA37bits_t;
extern volatile __ADCDATA37bits_t ADCDATA37bits __asm__ ("ADCDATA37") __attribute__((section("sfrs"), address(0xBF887850)));
extern volatile uint32_t        ADCDATA37CLR __attribute__((section("sfrs"),address(0xBF887854)));
extern volatile uint32_t        ADCDATA37SET __attribute__((section("sfrs"),address(0xBF887858)));
extern volatile uint32_t        ADCDATA37INV __attribute__((section("sfrs"),address(0xBF88785C)));
#define ADCDATA38 ADCDATA38
extern volatile uint32_t   ADCDATA38 __attribute__((section("sfrs"), address(0xBF887860)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA38bits_t;
extern volatile __ADCDATA38bits_t ADCDATA38bits __asm__ ("ADCDATA38") __attribute__((section("sfrs"), address(0xBF887860)));
extern volatile uint32_t        ADCDATA38CLR __attribute__((section("sfrs"),address(0xBF887864)));
extern volatile uint32_t        ADCDATA38SET __attribute__((section("sfrs"),address(0xBF887868)));
extern volatile uint32_t        ADCDATA38INV __attribute__((section("sfrs"),address(0xBF88786C)));
#define ADCDATA39 ADCDATA39
extern volatile uint32_t   ADCDATA39 __attribute__((section("sfrs"), address(0xBF887870)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA39bits_t;
extern volatile __ADCDATA39bits_t ADCDATA39bits __asm__ ("ADCDATA39") __attribute__((section("sfrs"), address(0xBF887870)));
extern volatile uint32_t        ADCDATA39CLR __attribute__((section("sfrs"),address(0xBF887874)));
extern volatile uint32_t        ADCDATA39SET __attribute__((section("sfrs"),address(0xBF887878)));
extern volatile uint32_t        ADCDATA39INV __attribute__((section("sfrs"),address(0xBF88787C)));
#define ADCDATA40 ADCDATA40
extern volatile uint32_t   ADCDATA40 __attribute__((section("sfrs"), address(0xBF887880)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA40bits_t;
