Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
  .extern DCH6ECON         /* 0xBF8114F0 */
  .extern DCH6ECONCLR      /* 0xBF8114F4 */
  .extern DCH6ECONSET      /* 0xBF8114F8 */
  .extern DCH6ECONINV      /* 0xBF8114FC */
  .extern DCH6INT          /* 0xBF811500 */
  .extern DCH6INTCLR       /* 0xBF811504 */
  .extern DCH6INTSET       /* 0xBF811508 */
  .extern DCH6INTINV       /* 0xBF81150C */
  .extern DCH6SSA          /* 0xBF811510 */
  .extern DCH6SSACLR       /* 0xBF811514 */
  .extern DCH6SSASET       /* 0xBF811518 */
  .extern DCH6SSAINV       /* 0xBF81151C */
  .extern DCH6DSA          /* 0xBF811520 */
  .extern DCH6DSACLR       /* 0xBF811524 */
  .extern DCH6DSASET       /* 0xBF811528 */
  .extern DCH6DSAINV       /* 0xBF81152C */
  .extern DCH6SSIZ         /* 0xBF811530 */
  .extern DCH6SSIZCLR      /* 0xBF811534 */
  .extern DCH6SSIZSET      /* 0xBF811538 */
  .extern DCH6SSIZINV      /* 0xBF81153C */
  .extern DCH6DSIZ         /* 0xBF811540 */
  .extern DCH6DSIZCLR      /* 0xBF811544 */
  .extern DCH6DSIZSET      /* 0xBF811548 */
  .extern DCH6DSIZINV      /* 0xBF81154C */
  .extern DCH6SPTR         /* 0xBF811550 */
  .extern DCH6SPTRCLR      /* 0xBF811554 */
  .extern DCH6SPTRSET      /* 0xBF811558 */
  .extern DCH6SPTRINV      /* 0xBF81155C */
  .extern DCH6DPTR         /* 0xBF811560 */
  .extern DCH6DPTRCLR      /* 0xBF811564 */
  .extern DCH6DPTRSET      /* 0xBF811568 */
  .extern DCH6DPTRINV      /* 0xBF81156C */
  .extern DCH6CSIZ         /* 0xBF811570 */
  .extern DCH6CSIZCLR      /* 0xBF811574 */
  .extern DCH6CSIZSET      /* 0xBF811578 */
  .extern DCH6CSIZINV      /* 0xBF81157C */
  .extern DCH6CPTR         /* 0xBF811580 */
  .extern DCS6CPTR         /* 0xBF811580 */
  .extern DCH6CPTRCLR      /* 0xBF811584 */
  .extern DCS6CPTRCLR      /* 0xBF811584 */
  .extern DCH6CPTRSET      /* 0xBF811588 */
  .extern DCS6CPTRSET      /* 0xBF811588 */
  .extern DCH6CPTRINV      /* 0xBF81158C */
  .extern DCS6CPTRINV      /* 0xBF81158C */
  .extern DCH6DAT          /* 0xBF811590 */
  .extern DCH6DATCLR       /* 0xBF811594 */
  .extern DCH6DATSET       /* 0xBF811598 */
  .extern DCH6DATINV       /* 0xBF81159C */
  .extern DCH7CON          /* 0xBF8115A0 */
  .extern DCH7CONCLR       /* 0xBF8115A4 */
  .extern DCH7CONSET       /* 0xBF8115A8 */
  .extern DCH7CONINV       /* 0xBF8115AC */
  .extern DCH7ECON         /* 0xBF8115B0 */
  .extern DCH7ECONCLR      /* 0xBF8115B4 */
  .extern DCH7ECONSET      /* 0xBF8115B8 */
  .extern DCH7ECONINV      /* 0xBF8115BC */
  .extern DCH7INT          /* 0xBF8115C0 */
  .extern DCH7INTCLR       /* 0xBF8115C4 */
  .extern DCH7INTSET       /* 0xBF8115C8 */
  .extern DCH7INTINV       /* 0xBF8115CC */
  .extern DCH7SSA          /* 0xBF8115D0 */
  .extern DCH7SSACLR       /* 0xBF8115D4 */
  .extern DCH7SSASET       /* 0xBF8115D8 */
  .extern DCH7SSAINV       /* 0xBF8115DC */
  .extern DCH7DSA          /* 0xBF8115E0 */
  .extern DCH7DSACLR       /* 0xBF8115E4 */
  .extern DCH7DSASET       /* 0xBF8115E8 */
  .extern DCH7DSAINV       /* 0xBF8115EC */
  .extern DCH7SSIZ         /* 0xBF8115F0 */
  .extern DCH7SSIZCLR      /* 0xBF8115F4 */
  .extern DCH7SSIZSET      /* 0xBF8115F8 */
  .extern DCH7SSIZINV      /* 0xBF8115FC */
  .extern DCH7DSIZ         /* 0xBF811600 */
  .extern DCH7DSIZCLR      /* 0xBF811604 */
  .extern DCH7DSIZSET      /* 0xBF811608 */
  .extern DCH7DSIZINV      /* 0xBF81160C */
  .extern DCH7SPTR         /* 0xBF811610 */
  .extern DCH7SPTRCLR      /* 0xBF811614 */
  .extern DCH7SPTRSET      /* 0xBF811618 */
  .extern DCH7SPTRINV      /* 0xBF81161C */
  .extern DCH7DPTR         /* 0xBF811620 */
  .extern DCH7DPTRCLR      /* 0xBF811624 */
  .extern DCH7DPTRSET      /* 0xBF811628 */
  .extern DCH7DPTRINV      /* 0xBF81162C */
  .extern DCH7CSIZ         /* 0xBF811630 */
  .extern DCH7CSIZCLR      /* 0xBF811634 */
  .extern DCH7CSIZSET      /* 0xBF811638 */
  .extern DCH7CSIZINV      /* 0xBF81163C */
  .extern DCH7CPTR         /* 0xBF811640 */
  .extern DCS7CPTR         /* 0xBF811640 */
  .extern DCH7CPTRCLR      /* 0xBF811644 */
  .extern DCS7CPTRCLR      /* 0xBF811644 */
  .extern DCH7CPTRSET      /* 0xBF811648 */
  .extern DCS7CPTRSET      /* 0xBF811648 */
  .extern DCH7CPTRINV      /* 0xBF81164C */
  .extern DCS7CPTRINV      /* 0xBF81164C */
  .extern DCH7DAT          /* 0xBF811650 */
  .extern DCH7DATCLR       /* 0xBF811654 */
  .extern DCH7DATSET       /* 0xBF811658 */
  .extern DCH7DATINV       /* 0xBF81165C */
  .extern T1CON            /* 0xBF820000 */
  .extern T1CONCLR         /* 0xBF820004 */
  .extern T1CONSET         /* 0xBF820008 */
  .extern T1CONINV         /* 0xBF82000C */
  .extern TMR1             /* 0xBF820010 */
  .extern TMR1CLR          /* 0xBF820014 */
  .extern TMR1SET          /* 0xBF820018 */
  .extern TMR1INV          /* 0xBF82001C */
  .extern PR1              /* 0xBF820020 */
  .extern PR1CLR           /* 0xBF820024 */
  .extern PR1SET           /* 0xBF820028 */
  .extern PR1INV           /* 0xBF82002C */
  .extern T2CON            /* 0xBF820200 */
  .extern T2CONCLR         /* 0xBF820204 */
  .extern T2CONSET         /* 0xBF820208 */
  .extern T2CONINV         /* 0xBF82020C */
  .extern TMR2             /* 0xBF820210 */
  .extern TMR2CLR          /* 0xBF820214 */
  .extern TMR2SET          /* 0xBF820218 */
  .extern TMR2INV          /* 0xBF82021C */
  .extern PR2              /* 0xBF820220 */
  .extern PR2CLR           /* 0xBF820224 */
  .extern PR2SET           /* 0xBF820228 */
  .extern PR2INV           /* 0xBF82022C */
  .extern T3CON            /* 0xBF820400 */
  .extern T3CONCLR         /* 0xBF820404 */
  .extern T3CONSET         /* 0xBF820408 */
  .extern T3CONINV         /* 0xBF82040C */
  .extern TMR3             /* 0xBF820410 */
  .extern TMR3CLR          /* 0xBF820414 */
  .extern TMR3SET          /* 0xBF820418 */
  .extern TMR3INV          /* 0xBF82041C */
  .extern PR3              /* 0xBF820420 */
  .extern PR3CLR           /* 0xBF820424 */
  .extern PR3SET           /* 0xBF820428 */
  .extern PR3INV           /* 0xBF82042C */
  .extern T4CON            /* 0xBF820600 */
  .extern T4CONCLR         /* 0xBF820604 */
  .extern T4CONSET         /* 0xBF820608 */
  .extern T4CONINV         /* 0xBF82060C */
  .extern TMR4             /* 0xBF820610 */
  .extern TMR4CLR          /* 0xBF820614 */
  .extern TMR4SET          /* 0xBF820618 */
  .extern TMR4INV          /* 0xBF82061C */
  .extern PR4              /* 0xBF820620 */
  .extern PR4CLR           /* 0xBF820624 */
  .extern PR4SET           /* 0xBF820628 */
  .extern PR4INV           /* 0xBF82062C */
  .extern T5CON            /* 0xBF820800 */
  .extern T5CONCLR         /* 0xBF820804 */
  .extern T5CONSET         /* 0xBF820808 */
  .extern T5CONINV         /* 0xBF82080C */
  .extern TMR5             /* 0xBF820810 */
  .extern TMR5CLR          /* 0xBF820814 */
  .extern TMR5SET          /* 0xBF820818 */
  .extern TMR5INV          /* 0xBF82081C */
  .extern PR5              /* 0xBF820820 */
  .extern PR5CLR           /* 0xBF820824 */
  .extern PR5SET           /* 0xBF820828 */
  .extern PR5INV           /* 0xBF82082C */
  .extern T6CON            /* 0xBF820A00 */
  .extern T6CONCLR         /* 0xBF820A04 */
  .extern T6CONSET         /* 0xBF820A08 */
  .extern T6CONINV         /* 0xBF820A0C */
  .extern TMR6             /* 0xBF820A10 */
  .extern TMR6CLR          /* 0xBF820A14 */
  .extern TMR6SET          /* 0xBF820A18 */
  .extern TMR6INV          /* 0xBF820A1C */
  .extern PR6              /* 0xBF820A20 */
  .extern PR6CLR           /* 0xBF820A24 */
  .extern PR6SET           /* 0xBF820A28 */
  .extern PR6INV           /* 0xBF820A2C */
  .extern T7CON            /* 0xBF820C00 */
  .extern T7CONCLR         /* 0xBF820C04 */
  .extern T7CONSET         /* 0xBF820C08 */
  .extern T7CONINV         /* 0xBF820C0C */
  .extern TMR7             /* 0xBF820C10 */
  .extern TMR7CLR          /* 0xBF820C14 */
  .extern TMR7SET          /* 0xBF820C18 */
  .extern TMR7INV          /* 0xBF820C1C */
  .extern PR7              /* 0xBF820C20 */
  .extern PR7CLR           /* 0xBF820C24 */
  .extern PR7SET           /* 0xBF820C28 */
  .extern PR7INV           /* 0xBF820C2C */
  .extern T8CON            /* 0xBF820E00 */
  .extern T8CONCLR         /* 0xBF820E04 */
  .extern T8CONSET         /* 0xBF820E08 */
  .extern T8CONINV         /* 0xBF820E0C */
  .extern TMR8             /* 0xBF820E10 */
  .extern TMR8CLR          /* 0xBF820E14 */
  .extern TMR8SET          /* 0xBF820E18 */
  .extern TMR8INV          /* 0xBF820E1C */
  .extern PR8              /* 0xBF820E20 */
  .extern PR8CLR           /* 0xBF820E24 */
  .extern PR8SET           /* 0xBF820E28 */
  .extern PR8INV           /* 0xBF820E2C */
  .extern T9CON            /* 0xBF821000 */
  .extern T9CONCLR         /* 0xBF821004 */
  .extern T9CONSET         /* 0xBF821008 */
  .extern T9CONINV         /* 0xBF82100C */
  .extern TMR9             /* 0xBF821010 */
  .extern TMR9CLR          /* 0xBF821014 */
  .extern TMR9SET          /* 0xBF821018 */
  .extern TMR9INV          /* 0xBF82101C */
  .extern PR9              /* 0xBF821020 */
  .extern PR9CLR           /* 0xBF821024 */
  .extern PR9SET           /* 0xBF821028 */
  .extern PR9INV           /* 0xBF82102C */
  .extern IC1CON           /* 0xBF822000 */
  .extern IC1CONCLR        /* 0xBF822004 */
  .extern IC1CONSET        /* 0xBF822008 */
  .extern IC1CONINV        /* 0xBF82200C */
  .extern IC1BUF           /* 0xBF822010 */
  .extern IC2CON           /* 0xBF822200 */
  .extern IC2CONCLR        /* 0xBF822204 */
  .extern IC2CONSET        /* 0xBF822208 */
  .extern IC2CONINV        /* 0xBF82220C */
  .extern IC2BUF           /* 0xBF822210 */
  .extern IC3CON           /* 0xBF822400 */
  .extern IC3CONCLR        /* 0xBF822404 */
  .extern IC3CONSET        /* 0xBF822408 */
  .extern IC3CONINV        /* 0xBF82240C */
  .extern IC3BUF           /* 0xBF822410 */
  .extern IC4CON           /* 0xBF822600 */
  .extern IC4CONCLR        /* 0xBF822604 */
  .extern IC4CONSET        /* 0xBF822608 */
  .extern IC4CONINV        /* 0xBF82260C */
  .extern IC4BUF           /* 0xBF822610 */
  .extern IC5CON           /* 0xBF822800 */
  .extern IC5CONCLR        /* 0xBF822804 */
  .extern IC5CONSET        /* 0xBF822808 */
  .extern IC5CONINV        /* 0xBF82280C */
  .extern IC5BUF           /* 0xBF822810 */
  .extern IC6CON           /* 0xBF822A00 */
  .extern IC6CONCLR        /* 0xBF822A04 */
  .extern IC6CONSET        /* 0xBF822A08 */
  .extern IC6CONINV        /* 0xBF822A0C */
  .extern IC6BUF           /* 0xBF822A10 */
  .extern IC7CON           /* 0xBF822C00 */
  .extern IC7CONCLR        /* 0xBF822C04 */
  .extern IC7CONSET        /* 0xBF822C08 */
  .extern IC7CONINV        /* 0xBF822C0C */
  .extern IC7BUF           /* 0xBF822C10 */
  .extern IC8CON           /* 0xBF822E00 */
  .extern IC8CONCLR        /* 0xBF822E04 */
  .extern IC8CONSET        /* 0xBF822E08 */
  .extern IC8CONINV        /* 0xBF822E0C */
  .extern IC8BUF           /* 0xBF822E10 */
  .extern IC9CON           /* 0xBF823000 */
  .extern IC9CONCLR        /* 0xBF823004 */
  .extern IC9CONSET        /* 0xBF823008 */
  .extern IC9CONINV        /* 0xBF82300C */
  .extern IC9BUF           /* 0xBF823010 */
  .extern OC1CON           /* 0xBF824000 */
  .extern OC1CONCLR        /* 0xBF824004 */
  .extern OC1CONSET        /* 0xBF824008 */
  .extern OC1CONINV        /* 0xBF82400C */
  .extern OC1R             /* 0xBF824010 */
  .extern OC1RCLR          /* 0xBF824014 */
  .extern OC1RSET          /* 0xBF824018 */
  .extern OC1RINV          /* 0xBF82401C */
  .extern OC1RS            /* 0xBF824020 */
  .extern OC1RSCLR         /* 0xBF824024 */
  .extern OC1RSSET         /* 0xBF824028 */
  .extern OC1RSINV         /* 0xBF82402C */
  .extern OC2CON           /* 0xBF824200 */
  .extern OC2CONCLR        /* 0xBF824204 */
  .extern OC2CONSET        /* 0xBF824208 */
  .extern OC2CONINV        /* 0xBF82420C */
  .extern OC2R             /* 0xBF824210 */
  .extern OC2RCLR          /* 0xBF824214 */
  .extern OC2RSET          /* 0xBF824218 */
  .extern OC2RINV          /* 0xBF82421C */
  .extern OC2RS            /* 0xBF824220 */
  .extern OC2RSCLR         /* 0xBF824224 */
  .extern OC2RSSET         /* 0xBF824228 */
  .extern OC2RSINV         /* 0xBF82422C */
  .extern OC3CON           /* 0xBF824400 */
  .extern OC3CONCLR        /* 0xBF824404 */
  .extern OC3CONSET        /* 0xBF824408 */
  .extern OC3CONINV        /* 0xBF82440C */
  .extern OC3R             /* 0xBF824410 */
  .extern OC3RCLR          /* 0xBF824414 */
  .extern OC3RSET          /* 0xBF824418 */
  .extern OC3RINV          /* 0xBF82441C */
  .extern OC3RS            /* 0xBF824420 */
  .extern OC3RSCLR         /* 0xBF824424 */
  .extern OC3RSSET         /* 0xBF824428 */
  .extern OC3RSINV         /* 0xBF82442C */
  .extern OC4CON           /* 0xBF824600 */
  .extern OC4CONCLR        /* 0xBF824604 */
  .extern OC4CONSET        /* 0xBF824608 */
  .extern OC4CONINV        /* 0xBF82460C */
  .extern OC4R             /* 0xBF824610 */
  .extern OC4RCLR          /* 0xBF824614 */
  .extern OC4RSET          /* 0xBF824618 */
  .extern OC4RINV          /* 0xBF82461C */
  .extern OC4RS            /* 0xBF824620 */
  .extern OC4RSCLR         /* 0xBF824624 */
  .extern OC4RSSET         /* 0xBF824628 */
  .extern OC4RSINV         /* 0xBF82462C */
  .extern OC5CON           /* 0xBF824800 */
  .extern OC5CONCLR        /* 0xBF824804 */
  .extern OC5CONSET        /* 0xBF824808 */
  .extern OC5CONINV        /* 0xBF82480C */
  .extern OC5R             /* 0xBF824810 */
  .extern OC5RCLR          /* 0xBF824814 */
  .extern OC5RSET          /* 0xBF824818 */
  .extern OC5RINV          /* 0xBF82481C */
  .extern OC5RS            /* 0xBF824820 */
  .extern OC5RSCLR         /* 0xBF824824 */
  .extern OC5RSSET         /* 0xBF824828 */
  .extern OC5RSINV         /* 0xBF82482C */
  .extern OC6CON           /* 0xBF824A00 */
  .extern OC6CONCLR        /* 0xBF824A04 */
  .extern OC6CONSET        /* 0xBF824A08 */
  .extern OC6CONINV        /* 0xBF824A0C */
  .extern OC6R             /* 0xBF824A10 */
  .extern OC6RCLR          /* 0xBF824A14 */
  .extern OC6RSET          /* 0xBF824A18 */
  .extern OC6RINV          /* 0xBF824A1C */
  .extern OC6RS            /* 0xBF824A20 */
  .extern OC6RSCLR         /* 0xBF824A24 */
  .extern OC6RSSET         /* 0xBF824A28 */
  .extern OC6RSINV         /* 0xBF824A2C */
  .extern OC7CON           /* 0xBF824C00 */
  .extern OC7CONCLR        /* 0xBF824C04 */
  .extern OC7CONSET        /* 0xBF824C08 */
  .extern OC7CONINV        /* 0xBF824C0C */
  .extern OC7R             /* 0xBF824C10 */
  .extern OC7RCLR          /* 0xBF824C14 */
  .extern OC7RSET          /* 0xBF824C18 */
  .extern OC7RINV          /* 0xBF824C1C */
  .extern OC7RS            /* 0xBF824C20 */
  .extern OC7RSCLR         /* 0xBF824C24 */
  .extern OC7RSSET         /* 0xBF824C28 */
  .extern OC7RSINV         /* 0xBF824C2C */
  .extern OC8CON           /* 0xBF824E00 */
  .extern OC8CONCLR        /* 0xBF824E04 */
  .extern OC8CONSET        /* 0xBF824E08 */
  .extern OC8CONINV        /* 0xBF824E0C */
  .extern OC8R             /* 0xBF824E10 */
  .extern OC8RCLR          /* 0xBF824E14 */
  .extern OC8RSET          /* 0xBF824E18 */
  .extern OC8RINV          /* 0xBF824E1C */
  .extern OC8RS            /* 0xBF824E20 */
  .extern OC8RSCLR         /* 0xBF824E24 */
  .extern OC8RSSET         /* 0xBF824E28 */
  .extern OC8RSINV         /* 0xBF824E2C */
  .extern OC9CON           /* 0xBF825000 */
  .extern OC9CONCLR        /* 0xBF825004 */
  .extern OC9CONSET        /* 0xBF825008 */
  .extern OC9CONINV        /* 0xBF82500C */
  .extern OC9R             /* 0xBF825010 */
  .extern OC9RCLR          /* 0xBF825014 */
  .extern OC9RSET          /* 0xBF825018 */
  .extern OC9RINV          /* 0xBF82501C */
  .extern OC9RS            /* 0xBF825020 */
  .extern OC9RSCLR         /* 0xBF825024 */
  .extern OC9RSSET         /* 0xBF825028 */
  .extern OC9RSINV         /* 0xBF82502C */
  .extern I2C1CON          /* 0xBF826000 */
  .extern I2C1CONCLR       /* 0xBF826004 */
  .extern I2C1CONSET       /* 0xBF826008 */
  .extern I2C1CONINV       /* 0xBF82600C */
  .extern I2C1STAT         /* 0xBF826010 */
  .extern I2C1STATCLR      /* 0xBF826014 */
  .extern I2C1STATSET      /* 0xBF826018 */
  .extern I2C1STATINV      /* 0xBF82601C */
  .extern I2C1ADD          /* 0xBF826020 */
  .extern I2C1ADDCLR       /* 0xBF826024 */
  .extern I2C1ADDSET       /* 0xBF826028 */
  .extern I2C1ADDINV       /* 0xBF82602C */
  .extern I2C1MSK          /* 0xBF826030 */
  .extern I2C1MSKCLR       /* 0xBF826034 */
  .extern I2C1MSKSET       /* 0xBF826038 */
  .extern I2C1MSKINV       /* 0xBF82603C */
  .extern I2C1BRG          /* 0xBF826040 */
  .extern I2C1BRGCLR       /* 0xBF826044 */
  .extern I2C1BRGSET       /* 0xBF826048 */
  .extern I2C1BRGINV       /* 0xBF82604C */
  .extern I2C1TRN          /* 0xBF826050 */
  .extern I2C1TRNCLR       /* 0xBF826054 */
  .extern I2C1TRNSET       /* 0xBF826058 */
  .extern I2C1TRNINV       /* 0xBF82605C */
  .extern I2C1RCV          /* 0xBF826060 */
  .extern I2C1RCVCLR       /* 0xBF826064 */
  .extern I2C1RCVSET       /* 0xBF826068 */
  .extern I2C1RCVINV       /* 0xBF82606C */
  .extern I2C2CON          /* 0xBF826200 */
  .extern I2C2CONCLR       /* 0xBF826204 */
  .extern I2C2CONSET       /* 0xBF826208 */
  .extern I2C2CONINV       /* 0xBF82620C */
  .extern I2C2STAT         /* 0xBF826210 */
  .extern I2C2STATCLR      /* 0xBF826214 */
  .extern I2C2STATSET      /* 0xBF826218 */
  .extern I2C2STATINV      /* 0xBF82621C */
  .extern I2C2ADD          /* 0xBF826220 */
  .extern I2C2ADDCLR       /* 0xBF826224 */
  .extern I2C2ADDSET       /* 0xBF826228 */
  .extern I2C2ADDINV       /* 0xBF82622C */
  .extern I2C2MSK          /* 0xBF826230 */
  .extern I2C2MSKCLR       /* 0xBF826234 */
  .extern I2C2MSKSET       /* 0xBF826238 */
  .extern I2C2MSKINV       /* 0xBF82623C */
  .extern I2C2BRG          /* 0xBF826240 */
  .extern I2C2BRGCLR       /* 0xBF826244 */
  .extern I2C2BRGSET       /* 0xBF826248 */
  .extern I2C2BRGINV       /* 0xBF82624C */
  .extern I2C2TRN          /* 0xBF826250 */
  .extern I2C2TRNCLR       /* 0xBF826254 */
  .extern I2C2TRNSET       /* 0xBF826258 */
  .extern I2C2TRNINV       /* 0xBF82625C */
  .extern I2C2RCV          /* 0xBF826260 */
  .extern I2C2RCVCLR       /* 0xBF826264 */
  .extern I2C2RCVSET       /* 0xBF826268 */
  .extern I2C2RCVINV       /* 0xBF82626C */
  .extern SPI1CON          /* 0xBF827000 */
  .extern SPI1CONCLR       /* 0xBF827004 */
  .extern SPI1CONSET       /* 0xBF827008 */
  .extern SPI1CONINV       /* 0xBF82700C */
  .extern SPI1STAT         /* 0xBF827010 */
  .extern SPI1STATCLR      /* 0xBF827014 */
  .extern SPI1STATSET      /* 0xBF827018 */
  .extern SPI1STATINV      /* 0xBF82701C */
  .extern SPI1BUF          /* 0xBF827020 */
  .extern SPI1BRG          /* 0xBF827030 */
  .extern SPI1BRGCLR       /* 0xBF827034 */
  .extern SPI1BRGSET       /* 0xBF827038 */
  .extern SPI1BRGINV       /* 0xBF82703C */
  .extern SPI1CON2         /* 0xBF827040 */
  .extern SPI1CON2CLR      /* 0xBF827044 */
  .extern SPI1CON2SET      /* 0xBF827048 */
  .extern SPI1CON2INV      /* 0xBF82704C */
  .extern SPI2CON          /* 0xBF827200 */
  .extern SPI2CONCLR       /* 0xBF827204 */
  .extern SPI2CONSET       /* 0xBF827208 */
  .extern SPI2CONINV       /* 0xBF82720C */
  .extern SPI2STAT         /* 0xBF827210 */
  .extern SPI2STATCLR      /* 0xBF827214 */
  .extern SPI2STATSET      /* 0xBF827218 */
  .extern SPI2STATINV      /* 0xBF82721C */
  .extern SPI2BUF          /* 0xBF827220 */
  .extern SPI2BRG          /* 0xBF827230 */
  .extern SPI2BRGCLR       /* 0xBF827234 */
  .extern SPI2BRGSET       /* 0xBF827238 */
  .extern SPI2BRGINV       /* 0xBF82723C */
  .extern SPI2CON2         /* 0xBF827240 */
  .extern SPI2CON2CLR      /* 0xBF827244 */
  .extern SPI2CON2SET      /* 0xBF827248 */
  .extern SPI2CON2INV      /* 0xBF82724C */
  .extern U1MODE           /* 0xBF828000 */
  .extern U1MODECLR        /* 0xBF828004 */
  .extern U1MODESET        /* 0xBF828008 */
  .extern U1MODEINV        /* 0xBF82800C */
  .extern U1STA            /* 0xBF828010 */
  .extern U1STACLR         /* 0xBF828014 */
  .extern U1STASET         /* 0xBF828018 */
  .extern U1STAINV         /* 0xBF82801C */
  .extern U1TXREG          /* 0xBF828020 */
  .extern U1RXREG          /* 0xBF828030 */
  .extern U1BRG            /* 0xBF828040 */
  .extern U1BRGCLR         /* 0xBF828044 */
  .extern U1BRGSET         /* 0xBF828048 */
  .extern U1BRGINV         /* 0xBF82804C */
  .extern U2MODE           /* 0xBF828200 */
  .extern U2MODECLR        /* 0xBF828204 */
  .extern U2MODESET        /* 0xBF828208 */
  .extern U2MODEINV        /* 0xBF82820C */
  .extern U2STA            /* 0xBF828210 */
  .extern U2STACLR         /* 0xBF828214 */
  .extern U2STASET         /* 0xBF828218 */
  .extern U2STAINV         /* 0xBF82821C */
  .extern U2TXREG          /* 0xBF828220 */
  .extern U2RXREG          /* 0xBF828230 */
  .extern U2BRG            /* 0xBF828240 */
  .extern U2BRGCLR         /* 0xBF828244 */
  .extern U2BRGSET         /* 0xBF828248 */
  .extern U2BRGINV         /* 0xBF82824C */
  .extern CMSTAT           /* 0xBF82C000 */
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C400 */
  .extern DAC1CONCLR       /* 0xBF82C404 */
  .extern DAC1CONSET       /* 0xBF82C408 */
  .extern DAC1CONINV       /* 0xBF82C40C */
  .extern DAC2CON          /* 0xBF82C600 */
  .extern DAC2CONCLR       /* 0xBF82C604 */
  .extern DAC2CONSET       /* 0xBF82C608 */
  .extern DAC2CONINV       /* 0xBF82C60C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
  .extern CLC1CON          /* 0xBF82D200 */
  .extern CLC1CONCLR       /* 0xBF82D204 */
  .extern CLC1CONSET       /* 0xBF82D208 */
  .extern CLC1CONINV       /* 0xBF82D20C */
  .extern CLC1SEL          /* 0xBF82D210 */
  .extern CLC1SELCLR       /* 0xBF82D214 */
  .extern CLC1SELSET       /* 0xBF82D218 */
  .extern CLC1SELINV       /* 0xBF82D21C */
  .extern CLC1GLS          /* 0xBF82D220 */
  .extern CLC1GLSCLR       /* 0xBF82D224 */
