Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
#define _CNNEC_CNNEC9_POSITION                   0x00000009
#define _CNNEC_CNNEC9_MASK                       0x00000200
#define _CNNEC_CNNEC9_LENGTH                     0x00000001

#define _CNNEC_CNNEC10_POSITION                  0x0000000A
#define _CNNEC_CNNEC10_MASK                      0x00000400
#define _CNNEC_CNNEC10_LENGTH                    0x00000001

#define _CNNEC_CNNEC11_POSITION                  0x0000000B
#define _CNNEC_CNNEC11_MASK                      0x00000800
#define _CNNEC_CNNEC11_LENGTH                    0x00000001

#define _CNNEC_CNNEC12_POSITION                  0x0000000C
#define _CNNEC_CNNEC12_MASK                      0x00001000
#define _CNNEC_CNNEC12_LENGTH                    0x00000001

#define _CNNEC_CNNEC13_POSITION                  0x0000000D
#define _CNNEC_CNNEC13_MASK                      0x00002000
#define _CNNEC_CNNEC13_LENGTH                    0x00000001

#define _CNNEC_CNNEC14_POSITION                  0x0000000E
#define _CNNEC_CNNEC14_MASK                      0x00004000
#define _CNNEC_CNNEC14_LENGTH                    0x00000001

#define _CNNEC_CNNEC15_POSITION                  0x0000000F
#define _CNNEC_CNNEC15_MASK                      0x00008000
#define _CNNEC_CNNEC15_LENGTH                    0x00000001

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_CNFC10_POSITION                    0x0000000A
#define _CNFC_CNFC10_MASK                        0x00000400
#define _CNFC_CNFC10_LENGTH                      0x00000001

#define _CNFC_CNFC11_POSITION                    0x0000000B
#define _CNFC_CNFC11_MASK                        0x00000800
#define _CNFC_CNFC11_LENGTH                      0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC13_POSITION                    0x0000000D
#define _CNFC_CNFC13_MASK                        0x00002000
#define _CNFC_CNFC13_LENGTH                      0x00000001

#define _CNFC_CNFC14_POSITION                    0x0000000E
#define _CNFC_CNFC14_MASK                        0x00004000
#define _CNFC_CNFC14_LENGTH                      0x00000001

#define _CNFC_CNFC15_POSITION                    0x0000000F
#define _CNFC_CNFC15_MASK                        0x00008000
#define _CNFC_CNFC15_LENGTH                      0x00000001

#define _SRCON0C_SR0C6_POSITION                  0x00000006
#define _SRCON0C_SR0C6_MASK                      0x00000040
#define _SRCON0C_SR0C6_LENGTH                    0x00000001

#define _SRCON0C_SR0C7_POSITION                  0x00000007
#define _SRCON0C_SR0C7_MASK                      0x00000080
#define _SRCON0C_SR0C7_LENGTH                    0x00000001

#define _SRCON0C_SR0C8_POSITION                  0x00000008
#define _SRCON0C_SR0C8_MASK                      0x00000100
#define _SRCON0C_SR0C8_LENGTH                    0x00000001

#define _SRCON0C_SR0C9_POSITION                  0x00000009
#define _SRCON0C_SR0C9_MASK                      0x00000200
#define _SRCON0C_SR0C9_LENGTH                    0x00000001

#define _SRCON0C_SR0C11_POSITION                 0x0000000B
#define _SRCON0C_SR0C11_MASK                     0x00000800
#define _SRCON0C_SR0C11_LENGTH                   0x00000001

#define _SRCON0C_SR0C15_POSITION                 0x0000000F
#define _SRCON0C_SR0C15_MASK                     0x00008000
#define _SRCON0C_SR0C15_LENGTH                   0x00000001

#define _SRCON1C_SR1C6_POSITION                  0x00000006
#define _SRCON1C_SR1C6_MASK                      0x00000040
#define _SRCON1C_SR1C6_LENGTH                    0x00000001

#define _SRCON1C_SR1C7_POSITION                  0x00000007
#define _SRCON1C_SR1C7_MASK                      0x00000080
#define _SRCON1C_SR1C7_LENGTH                    0x00000001

#define _SRCON1C_SR1C8_POSITION                  0x00000008
#define _SRCON1C_SR1C8_MASK                      0x00000100
#define _SRCON1C_SR1C8_LENGTH                    0x00000001

#define _SRCON1C_SR1C9_POSITION                  0x00000009
#define _SRCON1C_SR1C9_MASK                      0x00000200
#define _SRCON1C_SR1C9_LENGTH                    0x00000001

#define _SRCON1C_SR1C11_POSITION                 0x0000000B
#define _SRCON1C_SR1C11_MASK                     0x00000800
#define _SRCON1C_SR1C11_LENGTH                   0x00000001

#define _SRCON1C_SR1C15_POSITION                 0x0000000F
#define _SRCON1C_SR1C15_MASK                     0x00008000
#define _SRCON1C_SR1C15_LENGTH                   0x00000001

#define _TRISD_TRISD1_POSITION                   0x00000001
#define _TRISD_TRISD1_MASK                       0x00000002
#define _TRISD_TRISD1_LENGTH                     0x00000001

#define _TRISD_TRISD2_POSITION                   0x00000002
#define _TRISD_TRISD2_MASK                       0x00000004
#define _TRISD_TRISD2_LENGTH                     0x00000001

#define _TRISD_TRISD3_POSITION                   0x00000003
#define _TRISD_TRISD3_MASK                       0x00000008
#define _TRISD_TRISD3_LENGTH                     0x00000001

#define _TRISD_TRISD4_POSITION                   0x00000004
#define _TRISD_TRISD4_MASK                       0x00000010
#define _TRISD_TRISD4_LENGTH                     0x00000001

