Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0512gph064.h
#define _CFD1FIFOSTA21_TFNRFNIF_POSITION         0x00000000
#define _CFD1FIFOSTA21_TFNRFNIF_MASK             0x00000001
#define _CFD1FIFOSTA21_TFNRFNIF_LENGTH           0x00000001

#define _CFD1FIFOSTA21_TFHRFHIF_POSITION         0x00000001
#define _CFD1FIFOSTA21_TFHRFHIF_MASK             0x00000002
#define _CFD1FIFOSTA21_TFHRFHIF_LENGTH           0x00000001

#define _CFD1FIFOSTA21_TFERFFIF_POSITION         0x00000002
#define _CFD1FIFOSTA21_TFERFFIF_MASK             0x00000004
#define _CFD1FIFOSTA21_TFERFFIF_LENGTH           0x00000001

#define _CFD1FIFOSTA21_RXOVIF_POSITION           0x00000003
#define _CFD1FIFOSTA21_RXOVIF_MASK               0x00000008
#define _CFD1FIFOSTA21_RXOVIF_LENGTH             0x00000001

#define _CFD1FIFOSTA21_TXATIF_POSITION           0x00000004
#define _CFD1FIFOSTA21_TXATIF_MASK               0x00000010
#define _CFD1FIFOSTA21_TXATIF_LENGTH             0x00000001

#define _CFD1FIFOSTA21_TXERR_POSITION            0x00000005
#define _CFD1FIFOSTA21_TXERR_MASK                0x00000020
#define _CFD1FIFOSTA21_TXERR_LENGTH              0x00000001

#define _CFD1FIFOSTA21_TXLARB_POSITION           0x00000006
#define _CFD1FIFOSTA21_TXLARB_MASK               0x00000040
#define _CFD1FIFOSTA21_TXLARB_LENGTH             0x00000001

#define _CFD1FIFOSTA21_TXABT_POSITION            0x00000007
#define _CFD1FIFOSTA21_TXABT_MASK                0x00000080
#define _CFD1FIFOSTA21_TXABT_LENGTH              0x00000001

#define _CFD1FIFOSTA21_FIFOCI_POSITION           0x00000008
#define _CFD1FIFOSTA21_FIFOCI_MASK               0x00001F00
#define _CFD1FIFOSTA21_FIFOCI_LENGTH             0x00000005

#define _CFD1FIFOUA21_FIFOUA_POSITION            0x00000000
#define _CFD1FIFOUA21_FIFOUA_MASK                0xFFFFFFFF
#define _CFD1FIFOUA21_FIFOUA_LENGTH              0x00000020

#define _CFD1FIFOCON22_TFNRFNIE_POSITION         0x00000000
#define _CFD1FIFOCON22_TFNRFNIE_MASK             0x00000001
#define _CFD1FIFOCON22_TFNRFNIE_LENGTH           0x00000001

#define _CFD1FIFOCON22_TFHRFHIE_POSITION         0x00000001
#define _CFD1FIFOCON22_TFHRFHIE_MASK             0x00000002
#define _CFD1FIFOCON22_TFHRFHIE_LENGTH           0x00000001

#define _CFD1FIFOCON22_TFERFFIE_POSITION         0x00000002
#define _CFD1FIFOCON22_TFERFFIE_MASK             0x00000004
#define _CFD1FIFOCON22_TFERFFIE_LENGTH           0x00000001

#define _CFD1FIFOCON22_RXOVIE_POSITION           0x00000003
#define _CFD1FIFOCON22_RXOVIE_MASK               0x00000008
#define _CFD1FIFOCON22_RXOVIE_LENGTH             0x00000001

#define _CFD1FIFOCON22_TXATIE_POSITION           0x00000004
#define _CFD1FIFOCON22_TXATIE_MASK               0x00000010
#define _CFD1FIFOCON22_TXATIE_LENGTH             0x00000001

#define _CFD1FIFOCON22_RXTSEN_POSITION           0x00000005
#define _CFD1FIFOCON22_RXTSEN_MASK               0x00000020
#define _CFD1FIFOCON22_RXTSEN_LENGTH             0x00000001

#define _CFD1FIFOCON22_RTREN_POSITION            0x00000006
#define _CFD1FIFOCON22_RTREN_MASK                0x00000040
#define _CFD1FIFOCON22_RTREN_LENGTH              0x00000001

#define _CFD1FIFOCON22_TXEN_POSITION             0x00000007
#define _CFD1FIFOCON22_TXEN_MASK                 0x00000080
#define _CFD1FIFOCON22_TXEN_LENGTH               0x00000001

#define _CFD1FIFOCON22_UINC_POSITION             0x00000008
#define _CFD1FIFOCON22_UINC_MASK                 0x00000100
#define _CFD1FIFOCON22_UINC_LENGTH               0x00000001

#define _CFD1FIFOCON22_TXREQ_POSITION            0x00000009
#define _CFD1FIFOCON22_TXREQ_MASK                0x00000200
#define _CFD1FIFOCON22_TXREQ_LENGTH              0x00000001

#define _CFD1FIFOCON22_FRESET_POSITION           0x0000000A
#define _CFD1FIFOCON22_FRESET_MASK               0x00000400
#define _CFD1FIFOCON22_FRESET_LENGTH             0x00000001

#define _CFD1FIFOCON22_TXPRI_POSITION            0x00000010
#define _CFD1FIFOCON22_TXPRI_MASK                0x001F0000
#define _CFD1FIFOCON22_TXPRI_LENGTH              0x00000005

#define _CFD1FIFOCON22_TXAT_POSITION             0x00000015
#define _CFD1FIFOCON22_TXAT_MASK                 0x00600000
#define _CFD1FIFOCON22_TXAT_LENGTH               0x00000002

#define _CFD1FIFOCON22_FSIZE_POSITION            0x00000018
#define _CFD1FIFOCON22_FSIZE_MASK                0x1F000000
#define _CFD1FIFOCON22_FSIZE_LENGTH              0x00000005

#define _CFD1FIFOCON22_PLSIZE_POSITION           0x0000001D
#define _CFD1FIFOCON22_PLSIZE_MASK               0xE0000000
#define _CFD1FIFOCON22_PLSIZE_LENGTH             0x00000003

#define _CFD1FIFOSTA22_TFNRFNIF_POSITION         0x00000000
#define _CFD1FIFOSTA22_TFNRFNIF_MASK             0x00000001
#define _CFD1FIFOSTA22_TFNRFNIF_LENGTH           0x00000001

#define _CFD1FIFOSTA22_TFHRFHIF_POSITION         0x00000001
#define _CFD1FIFOSTA22_TFHRFHIF_MASK             0x00000002
#define _CFD1FIFOSTA22_TFHRFHIF_LENGTH           0x00000001

#define _CFD1FIFOSTA22_TFERFFIF_POSITION         0x00000002
#define _CFD1FIFOSTA22_TFERFFIF_MASK             0x00000004
#define _CFD1FIFOSTA22_TFERFFIF_LENGTH           0x00000001

#define _CFD1FIFOSTA22_RXOVIF_POSITION           0x00000003
#define _CFD1FIFOSTA22_RXOVIF_MASK               0x00000008
#define _CFD1FIFOSTA22_RXOVIF_LENGTH             0x00000001

#define _CFD1FIFOSTA22_TXATIF_POSITION           0x00000004
#define _CFD1FIFOSTA22_TXATIF_MASK               0x00000010
#define _CFD1FIFOSTA22_TXATIF_LENGTH             0x00000001

#define _CFD1FIFOSTA22_TXERR_POSITION            0x00000005
#define _CFD1FIFOSTA22_TXERR_MASK                0x00000020
#define _CFD1FIFOSTA22_TXERR_LENGTH              0x00000001

#define _CFD1FIFOSTA22_TXLARB_POSITION           0x00000006
#define _CFD1FIFOSTA22_TXLARB_MASK               0x00000040
#define _CFD1FIFOSTA22_TXLARB_LENGTH             0x00000001

#define _CFD1FIFOSTA22_TXABT_POSITION            0x00000007
#define _CFD1FIFOSTA22_TXABT_MASK                0x00000080
#define _CFD1FIFOSTA22_TXABT_LENGTH              0x00000001

#define _CFD1FIFOSTA22_FIFOCI_POSITION           0x00000008
#define _CFD1FIFOSTA22_FIFOCI_MASK               0x00001F00
#define _CFD1FIFOSTA22_FIFOCI_LENGTH             0x00000005

#define _CFD1FIFOUA22_FIFOUA_POSITION            0x00000000
#define _CFD1FIFOUA22_FIFOUA_MASK                0xFFFFFFFF
#define _CFD1FIFOUA22_FIFOUA_LENGTH              0x00000020

#define _CFD1FIFOCON23_TFNRFNIE_POSITION         0x00000000
#define _CFD1FIFOCON23_TFNRFNIE_MASK             0x00000001
#define _CFD1FIFOCON23_TFNRFNIE_LENGTH           0x00000001

#define _CFD1FIFOCON23_TFHRFHIE_POSITION         0x00000001
#define _CFD1FIFOCON23_TFHRFHIE_MASK             0x00000002
#define _CFD1FIFOCON23_TFHRFHIE_LENGTH           0x00000001

#define _CFD1FIFOCON23_TFERFFIE_POSITION         0x00000002
#define _CFD1FIFOCON23_TFERFFIE_MASK             0x00000004
#define _CFD1FIFOCON23_TFERFFIE_LENGTH           0x00000001

